# Вывести на 20 строках слово "Привет" с номером строки

i = 0
while i < 20:
  i += 1
  print(str(i) + " Привет")
